Revit 2027 API
BRepBuilder.CanAddGeometry Method
 A validator function that checks the state of this BRepBuilder object. Returns true if this BRepBuilder object is accepting b-rep data, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanAddGeometry()
Public Function CanAddGeometry As Boolean
public:
bool CanAddGeometry()
member CanAddGeometry : unit -> bool
Return Value
Boolean
 True if this BRepBuilder object is accepting b-rep data, false otherwise.
Remarks
 Use this function before calling AddFace(), AddEdge(), etc. to avoid an exception being thrown.
See Also
Reference
BRepBuilder Class
Autodesk.Revit.DB Namespace